OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/buoyantCavity/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// penaltyHeRhoThermo  pureMixture                const       hConst       rhoConst                  specie  sensibleInternalEnergy

thermoType
{
    type            penaltyHeRhoThermo;
    //type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    //energy          sensibleInternalEnergy;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.96;
    }
    equationOfState
    {
        R          3000;
        rho        1.2; //1027;
    }
    thermodynamics
    {
        Cp              1004.4;
        Hf              0;
    }
    transport
    {
        mu              1.831e-05;
        Pr              0.705;
    }
    solidProperties
    {
       Cp               2000;
       kappa            100;
    }
}


// ************************************************************************* //
